cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71J19.svd
            <register>
               <name>ST2CW112</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 12)</description>
               <addressOffset>0x764</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW013</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 13)</description>
               <addressOffset>0x768</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW113</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 13)</description>
               <addressOffset>0x76C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW014</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 14)</description>
               <addressOffset>0x770</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW114</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 14)</description>
               <addressOffset>0x774</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW015</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 15)</description>
               <addressOffset>0x778</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW115</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 15)</description>
               <addressOffset>0x77C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW016</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 16)</description>
               <addressOffset>0x780</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW116</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 16)</description>
               <addressOffset>0x784</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW017</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 17)</description>
               <addressOffset>0x788</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW117</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 17)</description>
               <addressOffset>0x78C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW018</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 18)</description>
               <addressOffset>0x790</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW118</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 18)</description>
               <addressOffset>0x794</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW019</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 19)</description>
               <addressOffset>0x798</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW119</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 19)</description>
               <addressOffset>0x79C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2CW020</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 20)</description>
               <addressOffset>0x7A0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
